<template>
    <div class="content-mp">
        <v-row>
            <v-col class="mt-0 pt-0" xs="12" sm="6" md="6" lg="6" xl="4">
                <div class="w-100 teacher-detail-info-service-nav mt-3">
                    <!-- <h3>Tùy chỉnh</h3> -->
                    <div class="w-100">
                        <div>
                            <b-card class="teacher-nav">
                                <label class="block w-100 teachers cs m-0 p-0" for="check">
                                    <div class="d-flex align-items-center justify-content-between">
                                        <div class="">
                                            <span class="me-2">
                                                <svg width="30" height="30" viewBox="0 0 30 30" fill="none"
                                                    xmlns="http://www.w3.org/2000/svg">
                                                    <circle cx="15" cy="15" r="15" fill="#FC4D32" fill-opacity="0.1" />
                                                    <path
                                                        d="M10.2 21.4641H12.2882C12.5605 21.4641 12.8311 21.4966 13.095 21.5616L15.3015 22.0998C15.7803 22.2169 16.279 22.2282 16.7628 22.1339L19.2024 21.6576C19.8468 21.5316 20.4397 21.2218 20.9043 20.7682L22.6303 19.083C23.1232 18.6026 23.1232 17.823 22.6303 17.3417C22.1865 16.9084 21.4838 16.8596 20.9817 17.2271L18.9701 18.7001C18.682 18.9115 18.3315 19.0253 17.9709 19.0253H16.0284L17.2649 19.0252C17.9618 19.0252 18.5263 18.4741 18.5263 17.7936V17.5473C18.5263 16.9823 18.1325 16.4897 17.5713 16.3531L15.6629 15.8873C15.3523 15.8117 15.0342 15.7735 14.7145 15.7735C13.9427 15.7735 12.5455 16.4149 12.5455 16.4149L10.2 17.3994M7 17.0582L7 21.7153C7 22.165 7 22.3898 7.08719 22.5616C7.16389 22.7127 7.28628 22.8355 7.43681 22.9125C7.60794 23 7.83196 23 8.28 23H8.92C9.36804 23 9.59206 23 9.76319 22.9125C9.91372 22.8355 10.0361 22.7127 10.1128 22.5616C10.2 22.3898 10.2 22.165 10.2 21.7153V17.0582C10.2 16.6085 10.2 16.3837 10.1128 16.2119C10.0361 16.0608 9.91372 15.938 9.76319 15.861C9.59206 15.7735 9.36804 15.7735 8.92 15.7735H8.28C7.83196 15.7735 7.60794 15.7735 7.43681 15.861C7.28628 15.938 7.16389 16.0608 7.08719 16.2119C7 16.3837 7 16.6085 7 17.0582ZM19.1531 8.2196C18.6756 7.21684 17.5749 6.6856 16.5043 7.19835C15.4338 7.7111 14.9778 8.92709 15.426 9.99457C15.703 10.6543 16.4966 11.9354 17.0625 12.8179C17.2716 13.1439 17.3761 13.307 17.5288 13.4023C17.6598 13.4842 17.8237 13.5282 17.9779 13.5231C18.1577 13.5172 18.3294 13.4284 18.6729 13.251C19.6026 12.7707 20.9281 12.0595 21.4967 11.6272C22.4166 10.9277 22.6445 9.64187 21.9557 8.66442C21.267 7.68697 20.0661 7.59079 19.1531 8.2196Z"
                                                        stroke="#FC4D32" stroke-width="1.5" stroke-linecap="round"
                                                        stroke-linejoin="round" />
                                                </svg>
                                            </span>
                                            <span>
                                                Bảo mẫu Pro
                                            </span>
                                        </div>
                                        <div>
                                            <div class="web-icon center">
                                                <input type="checkbox" id="check" class="input-check">
                                            </div>
                                        </div>
                                    </div>
                                </label>
                            </b-card>

                            <b-card class="teacher-nav">
                                <label class="block w-100 teachers cs m-0 p-0" for="check1">
                                    <div class="d-flex align-items-center justify-content-between">
                                        <div class="">
                                            <span class="me-2">
                                                <svg width="30" height="30" viewBox="0 0 30 30" fill="none"
                                                    xmlns="http://www.w3.org/2000/svg">
                                                    <circle cx="15" cy="15" r="15" fill="#FFB761" fill-opacity="0.2" />
                                                    <path
                                                        d="M19.5 17.464V14.8642C19.5 14.7089 19.5 14.6313 19.4754 14.5628C19.4537 14.5022 19.4182 14.447 19.3715 14.4012C19.3187 14.3494 19.2465 14.3146 19.102 14.2452L15 12.274M7.8 13.139V19.0267C7.8 19.3484 7.8 19.5093 7.85222 19.6501C7.89838 19.7746 7.97361 19.8873 8.07214 19.9795C8.18359 20.0838 8.33575 20.1508 8.64002 20.2849L14.4 22.8222C14.6207 22.9195 14.7311 22.9681 14.846 22.9873C14.9479 23.0042 15.0521 23.0042 15.154 22.9873C15.2689 22.9681 15.3793 22.9195 15.6 22.8222L21.36 20.2849C21.6643 20.1508 21.8164 20.0838 21.9279 19.9795C22.0264 19.8873 22.1016 19.7746 22.1478 19.6501C22.2 19.5093 22.2 19.3484 22.2 19.0267V13.139M6 12.274L14.678 8.10369C14.7961 8.04695 14.8551 8.01858 14.917 8.00742C14.9719 7.99753 15.0281 7.99753 15.083 8.00742C15.1449 8.01858 15.2039 8.04695 15.322 8.10369L24 12.274L15.322 16.4443C15.2039 16.501 15.1449 16.5294 15.083 16.5405C15.0281 16.5504 14.9719 16.5504 14.917 16.5405C14.8551 16.5294 14.7961 16.501 14.678 16.4443L6 12.274Z"
                                                        stroke="#FFB761" stroke-width="1.5" stroke-linecap="round"
                                                        stroke-linejoin="round" />
                                                </svg>

                                            </span>
                                            <span>
                                                Gia sư Pro
                                            </span>
                                        </div>
                                        <div>
                                            <div class="web-icon center">
                                                <input type="checkbox" id="check1" class="input-check">
                                            </div>
                                        </div>
                                    </div>
                                </label>
                            </b-card>

                            <b-card class="teacher-nav">
                                <label class="block w-100 teachers cs m-0 p-0" for="check2">
                                    <div class="d-flex align-items-center justify-content-between">
                                        <div class="">
                                            <span class="me-2">
                                                <svg width="30" height="30" viewBox="0 0 30 30" fill="none"
                                                    xmlns="http://www.w3.org/2000/svg">
                                                    <circle cx="15" cy="15" r="15" fill="#4EAEEA" fill-opacity="0.2" />
                                                    <path
                                                        d="M7 13.5305C7 13.0093 7 12.7487 7.0658 12.5087C7.12409 12.2961 7.21988 12.0961 7.34847 11.9186C7.49363 11.7182 7.69513 11.5582 8.09812 11.2382L14.1268 6.45116C14.4391 6.20319 14.5953 6.0792 14.7677 6.03154C14.9198 5.98949 15.0802 5.98949 15.2323 6.03154C15.4047 6.0792 15.5609 6.20319 15.8732 6.45116L21.9019 11.2382C22.3049 11.5582 22.5064 11.7182 22.6515 11.9186C22.7801 12.0961 22.8759 12.2961 22.9342 12.5087C23 12.7487 23 13.0093 23 13.5305V20.0961C23 21.1125 23 21.6208 22.8062 22.009C22.6358 22.3505 22.3638 22.6282 22.0293 22.8022C21.649 23 21.1512 23 20.1556 23H9.84444C8.8488 23 8.35097 23 7.97068 22.8022C7.63617 22.6282 7.36421 22.3505 7.19377 22.009C7 21.6208 7 21.1125 7 20.0961V13.5305Z"
                                                        stroke="#4EAEEA" stroke-width="1.5" stroke-linecap="round"
                                                        stroke-linejoin="round" />
                                                    <path
                                                        d="M19 16.1223V13.7527C19 13.3028 18.608 12.9691 18.132 13.0066H18.108C17.268 13.0741 15.992 13.4753 15.28 13.8952L15.212 13.9364C15.096 14.0039 14.904 14.0039 14.788 13.9364L14.688 13.8802C13.976 13.464 12.704 13.0666 11.864 13.0028C11.388 12.9654 11 13.3028 11 13.749V18.2781C11 18.6381 11.312 18.9755 11.696 19.0205L11.812 19.0355C12.68 19.1442 14.02 19.5566 14.788 19.9503L14.804 19.9578C14.912 20.0141 15.084 20.0141 15.188 19.9578C15.956 19.5604 17.3 19.1442 18.172 19.0355L18.304 19.0205C18.688 18.9755 19 18.6381 19 18.2781V17.6332"
                                                        stroke="#4EAEEA" stroke-width="1.5" stroke-linecap="round"
                                                        stroke-linejoin="round" />
                                                    <path d="M15 14V19" stroke="#4EAEEA" stroke-width="1.5"
                                                        stroke-linecap="round" stroke-linejoin="round" />
                                                </svg>

                                            </span>
                                            <span>
                                                Chương trình giáo dục sớm
                                            </span>
                                        </div>
                                        <div>
                                            <div class="web-icon center">
                                                <input type="checkbox" id="check2" class="input-check">
                                            </div>
                                        </div>
                                    </div>
                                </label>
                            </b-card>

                            <b-card class="teacher-nav">
                                <label class="block w-100 teachers cs m-0 p-0" for="check3">
                                    <div class="d-flex align-items-center justify-content-between">
                                        <div class="">
                                            <span class="me-2">
                                                <svg width="30" height="30" viewBox="0 0 30 30" fill="none"
                                                    xmlns="http://www.w3.org/2000/svg">
                                                    <circle cx="15" cy="15" r="15" fill="#00C092" fill-opacity="0.2" />
                                                    <path
                                                        d="M15.7618 17.7148L20.0703 24M13.7811 17.7148L9.47256 24M16.5377 16.2702C16.5377 17.2404 15.7469 18.027 14.7714 18.027C13.7959 18.027 13.0051 17.2404 13.0051 16.2702C13.0051 15.2999 13.7959 14.5134 14.7714 14.5134C15.7469 14.5134 16.5377 15.2999 16.5377 16.2702ZM19.3183 8.65645L8.91107 11.4301C8.67219 11.4937 8.55276 11.5256 8.47397 11.5961C8.40468 11.6582 8.35691 11.7405 8.33752 11.8312C8.31548 11.9343 8.34748 12.0531 8.41149 12.2907L9.18864 15.1755C9.25265 15.4131 9.28465 15.5319 9.35559 15.6103C9.41799 15.6792 9.50072 15.7267 9.59193 15.746C9.69563 15.7679 9.81507 15.7361 10.0539 15.6724L20.4612 12.8988L19.3183 8.65645ZM23.4195 13.0197C22.464 13.2744 21.9862 13.4017 21.5715 13.314C21.2066 13.2369 20.8757 13.0469 20.6261 12.7712C20.3423 12.4577 20.2143 11.9825 19.9583 11.0322L19.8212 10.5231C19.5651 9.5727 19.4371 9.09752 19.5253 8.68497C19.6028 8.32207 19.7939 7.99292 20.0711 7.74467C20.3862 7.46245 20.864 7.33513 21.8195 7.08048C22.0584 7.01681 22.1778 6.98498 22.2815 7.0069C22.3727 7.02619 22.4554 7.0737 22.5178 7.14262C22.5888 7.22098 22.6208 7.33978 22.6848 7.57737L23.9191 12.1591C23.9831 12.3967 24.0151 12.5155 23.9931 12.6186C23.9737 12.7093 23.9259 12.7916 23.8566 12.8537C23.7778 12.9242 23.6584 12.9561 23.4195 13.0197ZM7.26622 15.506L8.46049 15.1877C8.69936 15.124 8.8188 15.0922 8.89758 15.0216C8.96688 14.9596 9.01465 14.8773 9.03404 14.7866C9.05608 14.6834 9.02408 14.5646 8.96007 14.327L8.64006 13.1392C8.57606 12.9016 8.54405 12.7828 8.47312 12.7044C8.41072 12.6355 8.32799 12.588 8.23677 12.5687C8.13308 12.5468 8.01364 12.5786 7.77476 12.6423L6.58049 12.9606C6.34162 13.0242 6.22218 13.0561 6.14339 13.1266C6.0741 13.1887 6.02633 13.271 6.00694 13.3617C5.9849 13.4648 6.0169 13.5836 6.08091 13.8212L6.40091 15.0091C6.46492 15.2467 6.49692 15.3655 6.56786 15.4438C6.63026 15.5128 6.71299 15.5603 6.8042 15.5795C6.9079 15.6015 7.02734 15.5696 7.26622 15.506Z"
                                                        stroke="#00C092" stroke-width="1.5" stroke-linecap="round"
                                                        stroke-linejoin="round" />
                                                </svg>


                                            </span>
                                            <span>
                                                Thực hành kỹ năng cuộc sống
                                            </span>
                                        </div>
                                        <div>
                                            <div class="web-icon center">
                                                <input type="checkbox" id="check3" class="input-check">
                                            </div>
                                        </div>
                                    </div>
                                </label>
                            </b-card>

                            <b-card class="teacher-nav">
                                <label class="block w-100 teachers cs m-0 p-0" for="check4">
                                    <div class="d-flex align-items-center justify-content-between">
                                        <div class="">
                                            <span class="me-2">
                                                <svg width="30" height="30" viewBox="0 0 30 30" fill="none"
                                                    xmlns="http://www.w3.org/2000/svg">
                                                    <circle cx="15" cy="15" r="15" fill="#0056B1" fill-opacity="0.2" />
                                                    <path
                                                        d="M13.2 17.1726C14.3102 16.5615 15.6897 16.5615 16.7999 17.1726M6 17.5714L6.63134 11.5587C6.65528 11.3307 6.66724 11.2167 6.6856 11.1189C6.902 9.96601 7.90908 9.09802 9.13517 9.00766C9.23916 9 9.35944 9 9.6 9M24 17.5714L23.3687 11.5587C23.3447 11.3307 23.3328 11.2167 23.3144 11.1189C23.098 9.96601 22.0909 9.09802 20.8648 9.00766C20.7608 9 20.6406 9 20.4 9M12.1456 15.1471C13.5515 16.486 13.5515 18.6569 12.1456 19.9958C10.7397 21.3347 8.46031 21.3347 7.05441 19.9958C5.64853 18.6569 5.64853 16.486 7.05441 15.1471C8.4603 13.8081 10.7397 13.8081 12.1456 15.1471ZM22.9456 15.1471C24.3515 16.486 24.3515 18.6569 22.9456 19.9958C21.5397 21.3347 19.2603 21.3347 17.8544 19.9958C16.4485 18.6569 16.4485 16.486 17.8544 15.1471C19.2603 13.8081 21.5397 13.8081 22.9456 15.1471Z"
                                                        stroke="#0056B1" stroke-width="1.5" stroke-linecap="round"
                                                        stroke-linejoin="round" />
                                                </svg>


                                            </span>
                                            <span>
                                                Tư vấn và đào tạo
                                            </span>
                                        </div>
                                        <div>
                                            <div class="web-icon center">
                                                <input type="checkbox" id="check4" class="input-check">
                                            </div>
                                        </div>
                                    </div>
                                </label>
                            </b-card>

                            <b-card class="teacher-nav">
                                <label class="block w-100 teachers cs m-0 p-0" for="check5">
                                    <div class="d-flex align-items-center justify-content-between">
                                        <div class="">
                                            <span class="me-2">
                                                <svg width="30" height="30" viewBox="0 0 30 30" fill="none"
                                                    xmlns="http://www.w3.org/2000/svg">
                                                    <circle cx="15" cy="15" r="15" fill="#EB1B24" fill-opacity="0.2" />
                                                    <path
                                                        d="M24 15C24 16.78 23.4722 18.5201 22.4832 20.0001C21.4943 21.4802 20.0887 22.6337 18.4442 23.3149C16.7996 23.9961 14.99 24.1743 13.2442 23.8271C11.4984 23.4798 9.89472 22.6226 8.63604 21.364C7.37737 20.1053 6.5202 18.5016 6.17294 16.7558C5.82567 15.01 6.0039 13.2004 6.68509 11.5558C7.36628 9.91131 8.51983 8.50571 9.99987 7.51677C11.4799 6.52784 13.22 6 15 6C17.387 6 19.6761 6.94821 21.364 8.63604C23.0518 10.3239 24 12.6131 24 15V15ZM15 11V8V11ZM11.41 13.65L8.34 12.84L11.41 13.65ZM12.84 18L10.89 21L12.84 18ZM17.16 18L19.11 21L17.16 18ZM18.5 13.67L21.66 12.84L18.5 13.67ZM15 11L11.5 13.67L12.84 18H17.16L18.5 13.67L15 11Z"
                                                        stroke="#EB1B24" stroke-width="1.5" stroke-linecap="round"
                                                        stroke-linejoin="round" />
                                                </svg>
                                            </span>
                                            <span>
                                                Năng khiếu thể thao
                                            </span>
                                        </div>
                                        <div>
                                            <div class="web-icon center">
                                                <input type="checkbox" id="check5" class="input-check">
                                            </div>
                                        </div>
                                    </div>
                                </label>
                            </b-card>

                        </div>
                    </div>
                </div>

                <div class="mt-8">
                    <button-save>Lưu thay đổi</button-save>
                </div>

            </v-col>
        </v-row>
    </div>
</template>

<script>
// import { defineComponent } from '@vue/composition-api'

export default {
    layout: 'admin',
    data() {
        return {
            title: {
                name: 'Thay đổi dịch vụ',
                previous: '/admin/users/teachers/' + this.id
            },
            currentPassword: "",
            newPassword: "",
            confirmNewPassword: "",
            showPassword: false,
        };
    },
    validate({ params }) {
        return /^[0-9]{0,2}$/.test(params.id)
    },
    computed: {
        id() {
            console.log(this.$route.params.id)
            return this.$route.params.id
        }
    },
    methods: {
        togglePassword() {
            this.showPassword = !this.showPassword;
        },
    },
    mounted() {
        this.title.previous = '/admin/users/teachers/' + this.id
        this.$store.dispatch('title/set_title', this.title);
    },
}
</script>
